brew 'coreutils' # brew info coreutils
brwe 'bzip2' # 一些工具的基础
brew 'gnu-sed'
brew 'ctags'
brew 'git'
brew 'git-lfs'
brew 'wget'
brew 'aria2'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'youtube-dl'
brew 'hub'
brew 'fzf'
brwe 'bunzip2'
brew 'python3'
brew 'jq'
brew 'ripgrep'
# brew 'ack'
# brew 'the_silver_searcher'
# brew 'neovim'
brew 'yarn', args: ['ignore-dependencies']
brew 'node'
brew 'vim'
brew 'rclone'
brew 'pyenv'

# less
# brew 'fontconfig'


tap 'caskroom/cask'
cask 'google-chrome'
cask 'appcleaner'
cask 'visual-studio-code'
cask 'iterm2'
cask 'telegram'
cask 'sourcetree'

# Disk
cask 'osxfuse' # fuse setting panel

# Video
cask 'mpv'
# mpv 内核，自动下载字幕
cask 'iina'

# Finder quicklook plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'quicklook-csv'
# preview zip file list
cask 'betterzip'
# Display image size and resolution
cask 'qlimagesize'
# preview apple pkg installer file
cask 'suspicious-package'
# preview README INSTALL eapfile CHANGELOG etc...
cask 'qlstephen'
# Preview source code files with syntax highlighting
cask 'qlcolorcode'


# Fonts install
tap 'caskroom/fonts'

# Optional software
cask 'hammerspoon' # replacement: slate, Spectacle
cask 'dash'
cask 'dropbox'
cask 'eudic'
cask 'github' # replacement: gitkraken
cask 'virtualbox'
cask 'squirrel'
cask 'docker'

# cask 'helium'
# cask 'endurance'
# cask 'java' # include jdk9
# cask 'real-vnc'
# cask 'wireshark'
# cask 'charles'
# cask 'postman'
# cask 'cap' # 录制 gif
# cask 'amazon-music'
# cask 'smcfancontrol'
# cask 'wifi-explorer'
# cask 'numi'
# cask 'megasync', args: { appdir: "/Applications" }
# cask 'suspicious-package' # check & inspect pkg installer
# cask 'db-browser-for-sqlite' # 在 app store 安装 sqlpro-for-sqlite lite

# 暂时不能用 app store 软件的
# casilla # hide all application
