brew 'ctags'
brew 'git'
brew 'wget'
brew 'aria2'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'gnu-sed'
brew 'youtube-dl'
brew 'hub'
brew 'fzf'
brew 'python3'
brew 'jq'
brew 'ripgrep'
# brew 'ack'
# brew 'the_silver_searcher'
# brew 'neovim'
brew 'yarn', args: ['ignore-dependencies']


tap 'caskroom/cask'

cask 'google-chrome'
cask 'dropbox'
cask 'amazon-music'
cask 'dropbox'
cask 'dash'
cask 'appcleaner'
cask 'megasync', args: { appdir: "/Applications" }
cask 'wireshark'
cask 'cap' # 录制 gif

# disk
cask 'osxfuse' # fuse setting panel

# video
cask 'mpv'
# mpv 内核，自动下载字幕
cask 'iina'

# finder quicklook plugins
# https://github.com/sindresorhus/quick-look-plugins
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'quicklook-csv'
# preview zip file list
cask 'betterzipql'
# Display image size and resolution
cask 'qlimagesize'
# preview apple pkg installer file
cask 'suspicious-package'
# preview README INSTALL Capfile CHANGELOG etc...
cask 'qlstephen'
# Preview source code files with syntax highlighting
cask 'qlcolorcode'


# fonts install
tap 'caskroom/fonts'

# optional software
# window manage
# cask slate
