# 安装方式：brew bundle

brew 'coreutils' # brew info coreutils
brew 'bzip2' # 一些工具的基础
brew 'gnu-sed'
# brew 'ctags'
# brew 'git'
brew 'git-lfs'
brew 'wget'
brew 'aria2'
brew 'tmux'
brew 'reattach-to-user-namespace'
brew 'youtube-dl'
brew 'hub'
brew 'python3'
brew 'jq'
# brew 'neovim'
# brew 'yarn', args: ['ignore-dependencies']
brew 'node'
brew 'vim'
brew 'rclone'
brew 'pyenv'
brew 'ccat' # 类似 cat 但输出彩色
# brew 'watch' # mac no watch command

# Search
brew 'fzf'
# brew 'fd' # instead of find
# brew 'the_silver_searcher'
# brew 'ripgrep' # rg
# brew 'ack'


######################################################################
# Shell: iTerm2, zsh, oh-my-zsh plugins and themes                   #
######################################################################

cask 'iterm2'
brew 'zsh'
brew 'zsh-autosuggestions'

tap 'homebrew/cask-fonts'
cask 'font-menlo-for-powerline'

# less
# brew 'fontconfig'


cask "macpass"
cask 'google-chrome'
cask 'appcleaner'
cask 'alfred'
cask 'visual-studio-code'
cask 'iterm2'
cask 'telegram'
# cask 'sourcetree'
cask 'tableplus'

# Disk
# cask 'osxfuse' # fuse setting panel

# Video
# cask 'mpv'
# mpv 内核，自动下载字幕
cask 'iina'
# 让麦克风的声音传到扬声器中，用来录制视频的时候录制系统播放的声音
# https://www.zhihu.com/question/26032781
# cask 'soundflower'

# Finder quicklook plugins
# https://github.com/sindresorhus/quick-look-plugins
# cask 'quicklook-json'
# cask 'qlmarkdown'
# cask 'quicklook-csv'
# preview zip file list
# cask 'betterzip'
# Display image size and resolution
# cask 'qlimagesize'
# preview apple pkg installer file
# cask 'suspicious-package'
# preview README INSTALL eapfile CHANGELOG etc...
# cask 'qlstephen'
# Preview source code files with syntax highlighting
# cask 'qlcolorcode'


# Fonts install
# tap 'caskroom/fonts'

# Optional software
cask 'hammerspoon' # replacement: slate, Spectacle
# cask 'dash'
cask 'dropbox'
cask 'eudic'
# cask 'github' # replacement: gitkraken
# cask 'virtualbox'
cask 'squirrel'
# cask 'docker'

# cask 'helium'
# cask 'endurance'
# cask 'java' # include jdk9
# cask 'real-vnc'
# cask 'wireshark'
# cask 'charles'
cask 'postman'
# cask 'cap' # 录制 gif
# cask 'amazon-music'
# cask 'smcfancontrol'
# cask 'wifi-explorer'
# cask 'numi'
# cask 'megasync', args: { appdir: "/Applications" }
# cask 'suspicious-package' # check & inspect pkg installer
# cask 'db-browser-for-sqlite' # 在 app store 安装 sqlpro-for-sqlite lite

# 暂时不能用 app store 软件的
# casilla # hide all application

# android
# cask android-sdk
# cask android-platform-tools


# 学习看看这些软件
# cask "seashore"               # simple image editing for everyone
# cask "imageoptim"             # shrinking all kinds of images
# cask "imagealpha"             # PNG optimizer
# cask "krita"
# cask "paintbrush"
#
# cask "quicksilver"            # productivity app (a better Spotlight)

# mas install
# gifbrewery # git video 转换
# bear
# reeder
#
