amatiasq.sort-imports
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
eg2.tslint
esbenp.prettier-vscode
gcazaciuc.vscode-flow-ide
HookyQR.beautify
joelday.docthis
mike-lischke.vscode-antlr4
mrmlnc.vscode-scss
ms-python.python
ms-vscode.cpptools
msjsdiag.debugger-for-chrome
octref.vetur
patrys.vscode-code-outline
rebornix.nova
sdras.vue-vscode-snippets
streetsidesoftware.code-spell-checker
thekalinga.bootstrap4-vscode
tombonnike.vscode-status-bar-format-toggle
vlkoti.vscode-sourcemaps-navigator
vscodevim.vim
Ying.jsbox
