amatiasq.sort-imports
bierner.color-info
christian-kohler.npm-intellisense
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
DotJoshJohnson.xml
eamodio.gitlens
eg2.vscode-npm-script
esbenp.prettier-vscode
joelday.docthis
kumar-harsh.graphql-for-vscode
mike-lischke.vscode-antlr4
mrmlnc.vscode-scss
ms-azuretools.vscode-docker
ms-python.python
ms-vscode.cpptools
ms-vscode.vscode-typescript-tslint-plugin
msjsdiag.debugger-for-chrome
octref.vetur
patrys.vscode-code-outline
prograhammer.tslint-vue
rebornix.nova
redhat.java
redhat.vscode-xml
sdras.vue-vscode-snippets
shengchen.vscode-leetcode
slevesque.vscode-hexdump
streetsidesoftware.code-spell-checker
thekalinga.bootstrap4-vscode
tombonnike.vscode-status-bar-format-toggle
vadimcn.vscode-lldb
vlkoti.vscode-sourcemaps-navigator
vscjava.vscode-java-debug
vscodevim.vim
wix.vscode-import-cost
Ying.jsbox
yzhang.markdown-all-in-one
