HookyQR.beautify
akamud.vscode-javascript-snippet-pack
alexdima.copy-relative-path
christian-kohler.npm-intellisense
dbaeumer.vscode-eslint
eamodio.gitlens
eg2.tslint
esbenp.prettier-vscode
joelday.docthis
ms-python.python
ms-vscode.cpptools
msjsdiag.debugger-for-chrome
octref.vetur
redhat.java
sdras.vue-vscode-snippets
thekalinga.bootstrap4-vscode
tombonnike.vscode-status-bar-format-toggle
vscjava.vscode-java-debug
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
xabikos.JavaScriptSnippets
